<?php

return [
    'required' => 'هذا الحقل مطلوب.',
    'exists' => 'القيمة المختارة غير موجودة.',
    'min' => 'القيمة يجب أن تكون أكبر من أو تساوي 0.',
    'string' => 'يجب أن يكون هذا الحقل نصًا.',
    'numeric' => 'القيمة يجب أن تكون رقم.',
    'url' => 'يرجي ادخال عنوان صحيح',
    'max' => [
        'string' => 'يجب أن لا يتجاوز :max حرفًا.',
        'numeric' => 'يجب أن لا يتجاوز :max.',
    ],
    'email' => [
        'required' => 'البريد الإلكتروني مطلوب.',
        'string' => 'البريد الإلكتروني يجب أن يكون نصًا.',
        'lowercase' => 'البريد الإلكتروني يجب أن يكون بحروف صغيرة.',
        'email' => 'البريد الإلكتروني غير صالح.',
        'max' => 'البريد الإلكتروني يجب أن لا يتجاوز :max حرفًا.',
        'unique' => 'هذا البريد الإلكتروني موجود بالفعل.',
    ],
    'phone' => [
        'required' => 'رقم الهاتف مطلوب.',
        'string' => 'رقم الهاتف يجب أن يكون نصًا.',
        'max' => 'رقم الهاتف يجب أن لا يتجاوز :max رقمًا.',
        'unique' => 'هذا رقم الهاتف موجود بالفعل.',
        'regex' => 'رقم الهاتف يجب أن يتكون من أرقام فقط.',
    ],
    'role' => [
        'required' => 'الدور مطلوب.',
        'in' => 'الدور يجب أن يكون إما admin أو superadmin.',
    ],
    'image' => [
        'image' => 'الملف يجب أن يكون صورة.',
        'mimes' => 'الصورة يجب أن تكون من نوع jpeg, png, jpg، أو gif.',
        'max' => 'حجم الصورة يجب أن يكون أقل من :max كيلوبايت.',
    ],
    'password' => [
        'required' => 'يرجى إدخال كلمة المرور.',
        'string' => 'يجب أن تكون كلمة المرور نصًا.',
        'min' => 'يجب أن تحتوي كلمة المرور على :min حرفًا على الأقل.',
        'confirmed' => 'كلمة المرور وتأكيد كلمة المرور غير متطابقتين.',
        'mixed' => 'يجب أن تحتوي كلمة المرور على أحرف كبيرة وصغيرة.',
        'numbers' => 'يجب أن تحتوي كلمة المرور على أرقام.',
        'symbols' => 'يجب أن تحتوي كلمة المرور على رموز خاصة.',
        'uncompromised' => 'كلمة المرور المدخلة كانت جزءًا من اختراق بيانات معروف.',
    ],
    'client_id' => [
        'required' => 'اختيار الموكل مطلوب.',
    ],
    'files.*' => [
        'file' => 'كل ملف مرفق يجب أن يكون ملفاً.',
        'mimes' => 'كل ملف يجب أن يكون بصيغة PDF.',
        'max' => 'حجم كل ملف يجب أن لا يتجاوز 2 ميجابايت.',
    ],
];
