<?php

return [
    'required' => 'هذا الحقل مطلوب.',
    'string' => 'يجب أن يكون هذا الحقل نصًا.',
    'max' => [
        'string' => 'يجب أن لا يتجاوز :max حرفًا.',
    ],
    'email' => [
        'required' => 'البريد الإلكتروني مطلوب.',
        'string' => 'البريد الإلكتروني يجب أن يكون نصًا.',
        'lowercase' => 'البريد الإلكتروني يجب أن يكون بحروف صغيرة.',
        'email' => 'البريد الإلكتروني غير صالح.',
        'max' => 'البريد الإلكتروني يجب أن لا يتجاوز :max حرفًا.',
        'unique' => 'هذا البريد الإلكتروني موجود بالفعل.',
    ],
    'phone' => [
        'required' => 'رقم الهاتف مطلوب.',
        'string' => 'رقم الهاتف يجب أن يكون نصًا.',
        'max' => 'رقم الهاتف يجب أن لا يتجاوز :max رقمًا.',
        'unique' => 'هذا رقم الهاتف موجود بالفعل.',
    ],
    'role' => [
        'required' => 'الدور مطلوب.',
        'in' => 'الدور يجب أن يكون إما admin أو superadmin.',
    ],
];
